import React from "react";

function Step2({ setIsAgreed }: { setIsAgreed?: any }) {
  return (
    <div className="flex flex-col gap-2">
      <span className="text-xl sm:text-2xl xl:text-3xl font-bold">
        Платформыг ашиглах үйлчилгээний нөхцөл
      </span>
      <span className="text-[#6F6F6F] text-sm sm:text-base">
        Сүүлд шинэчлэгдсэн: 2024.12.13
      </span>

      <div className="text-xs sm:text-sm md:text-base lg:text-lg font-thin rounded-3xl border border-[#CDCDCD] py-3 sm:py-6 px-5 sm:px-8 w-full overflow-y-auto max-h-[160px] sm:max-h-[330px]">
        Ерөнхий зүйл:  <br />
        <ul className="list-decimal">
          <li>
            Geni Сурагч нь Geni Платформыг ашиглан Geni сурагчын хөтөлбөрийн
            видео хичээлүүдийг худалдан авч үзэх болон хөтөлбөрийн даалгавар
            контентийг хийж илгээхэд ашиглана.
          </li>
        </ul>
        <br />
        Платформ ашиглах тухай: <br />
        <ul className="list-decimal">
          <li>
            Контент бүтээгч нь Geni платформ дээр өөрийн албан ёсны хаягыг
            үүсгэн Geni Сурагчын хөтөлбөрийг худалдан авч, үзэх боломжтой.
          </li>
          <li>
            Geni платформ дээрх хэрэглэгчийн хувийн мэдээллийн аюулгүй байдлыг
            Geni платформын зүгээс хангах үүрэгтэй.
          </li>
          <li>
            Сурагч нь өөрийн хурдаар хичээлүүдээ үзэн хүссэн үедээ даалгавар
            контентоо илгээх боломжтой.
          </li>
          <li>
            Платформоор дамжуулан хөтөлбөрийн даалгаварыг илгээх бөгөөд уг
            даалгавар дээр Geni платформын зүгээс зөвлөгөө өгөх үүрэгтэй.
          </li>
          <li>
            Сурагч нь даалгавар дээр өгсөн зөвлөгөөний дагуу дахин даалгавар
            хийн илгээх үүрэгтэй.
          </li>
          <li>
            Сурагчын даалгавар Geni платформын шалгуурыг хангасан тохиолдолд
            албан ёсны Контент бүтээгч болох боломжтой.
          </li>
          <li>
            Сурагчын даалгавар тэнцсэнээр Албан ёсны контент бүтээгчийн хаягтай
            болж Брэндүүдтэй хамтрах эрхийг Geni Платформоос нээж өгөх үүрэгтэй.
          </li>
        </ul>
      </div>
    </div>
  );
}

export default Step2;
