"use client";

export default function TosPage() {
  return (
    <div className="container my-16 lg:my-28 px-5 lg:px-8">
      <h1 className="text-2xl md:text-4xl lg:text-5xl font-black">
        Geni Платформыг ашиглах дүрэж, журмууд
      </h1>
      <p className="mt-4 text-lg md:text-2xl">
        Сүүлд шинэчлэгдсэн огноо: <br className="md:hidden" /> 2025.04.05
      </p>
      <div
        className="w-full mt-12"
        dangerouslySetInnerHTML={{
          __html: `<!DOCTYPE html>
            <html>
            <head>
            <title>Geni: Terms of Service</title>
            <style>
                ul, ol { 
                display: block;
                list-style: disc outside none;
                margin: 1em 0;
                padding: 0 0 0 40px;
                }
                ol { 
                    list-style-type: decimal;
                }
                    li { 
                    display: list-item;
                }
                    ul ul, ol ul {
                    list-style-type: circle;
                    margin-left: 15px; 
                }
                ol ol, ul ol { 
                    list-style-type: lower-latin;
                    margin-left: 15px; 
                }
            </style>
            </head>
            <body>
            <p><span style="white-space: pre-wrap;">Geni Брэнд</span></p>
            <p><span style="white-space: pre-wrap;"><br>Ерөнхий зүйл: </span></p>
            <ol>
                <li>Байгууллага буюу брэнд нь Geni Платформыг ашиглан Geni Платформ дээрх контент бүтээгчидтэй хамтран хэрэглэгчийн бүтээсэн видео контент бүтээж ажиллах ажлын үүрэг хариуцлага болон харилцааг зохицуулахад оршино.</li>
                <li>Брэнд нь Geni платформоор дамжуулан Geni платформ дээрх бүх контент бүтээгчидтэй хамтран ажиллах боломжтой.</li>
                <li>Geni платформ нь Брэндийг контент бүтээгчидтэй хамтран ажиллахад нь жуучлах болон хоорондын харилцаа холбоог зохицуулах үүрэгтэй.</li>
                <li>Geni платформ дээрх контент бүтээгчидтэй хамтран ажиллахдаа бүтээгдэхүүнээ контент бүтээгчдэд санал болгох үүднээс Geni платформруу илгээх ёстой бөгөөд энэ нь контент бүтээгчийн контентоо бүтээхэд зориулсан урсгал зардал гэж тооцогдоно.<br><span style="white-space: pre-wrap;"><br>Платформ ашиглах тухай:</span></li>
                <li><span style="white-space: pre-wrap;">Брэнд нь Geni платформ дээр өөрийн албан ёсны хаягыг үүсгэн Geni платформ дээрх контент бүтээгчидтэй хамтрах боломжтой.</span></li>
                <li><span style="white-space: pre-wrap;">Geni платформоор дамжуулан контент бүтээгчидтэй хамтран ажиллахдаа контент бүтээгчидтэй хамтран ажиллах эрх буюу &ldquo;Geni Credit&rdquo;-г идэвхжүүлж цэнэглэсний дараа контент бүтээгчидтэй хамтрах эрхтэй болно.<br></span></li>
                <li><span style="white-space: pre-wrap;">&ldquo;Geni Credit&rdquo; дууссан тохиолдолд Geni платформыг ашиглан хүссэн үедээ дахин цэнэглэж ашиглах боломжтой<br></span></li>
                <li><span style="white-space: pre-wrap;">Брэнд нь &ldquo;Geni Credit&rdquo;-н цэнэглэсэн тоогоо ашиглан Geni платформ дээр өөрсдийн бараа бүтээгдэхүүний мэдээллээ болон ямар агуулгатай контент контент бүтээгчдээс авмаар байгаа хүсэлтээ ойлгомжтой сайн бичиж илгээх шаардлагатай бөгөөд уг бичсэн илгээсэн хүсэлтийн дагуу контент бүтээгчид контентоо хийж илгээх юм.<br></span></li>
                <li><span style="white-space: pre-wrap;">Бүтээгдэхүүний хүсэлтээ илгээхдээ нэг контент бүтээгчид хамгийн багадаа 30&rsquo;000 төгрөгний үнэ бүхий бүтээгдэхүүнийг санал болгоно. Энэ нь контент бүтээгчдийн сэтгэл ханамжыг хангахад зориулагдана.<br></span></li>
                <li><span style="white-space: pre-wrap;">Бүтээгдэхүүний мэдээлэл илгээсний дараа оруулсан мэдээллийн дагуу бүтээгдэхүүнээ Geni платформ-н агуулахруу хүргүүлэх үүрэгтэй.<br></span></li>
                <li><span style="white-space: pre-wrap;">Geni платформын зүгээс бараа бүтээгдэхүүний илгээсэн мэдээллийг шалгасны дараагаар албан ёсоор платформ дээр бүтээгдэхүүний мэдээлэл байршина.<br></span></li>
                <li><span style="white-space: pre-wrap;">Geni платформ дээр бүтээгдэхүүний мэдээлэл байршсаны дараагаар тухайн бүтээгдэхүүнийг авч контент бүтээх хүсэлтээ контент бүтээгчид Geni платформ луу илгээнэ.<br></span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгчдийн хүсэлтийг Geni платформоос хүлээн зөвшөөрсөнөөс эхлэн контент брэндэд очих хүртэлх бүх процессийг платформоор дамжуулан хянана. Үүнд дараах төлөвүүд орно:</span><br>
                    <ol style="list-style-type: lower-alpha;">
                        <li><span style="white-space: pre-wrap;">Бүтээгдэхүүн контент бүтээгчид хүргэгдэж байна.</span></li>
                        <li><span style="white-space: pre-wrap;">Контент бүтээгч бүтээгдэхүүнийг хүлээн авсан.</span></li>
                        <li><span style="white-space: pre-wrap;">Контент бүтээгч контентоо хийж байна.</span></li>
                        <li><span style="white-space: pre-wrap;">Контент бүтээгч контентоо илгээлээ.</span></li>
                        <li><span style="white-space: pre-wrap;">Контент бүтээгчийн контентийг Geni платформын зүгээс шалгаж байна.</span></li>
                        <li><span style="white-space: pre-wrap;">Контент бүтээгчийн контент шаардлага хангаагүй тул засварлаж байна.</span></li>
                        <li><span style="white-space: pre-wrap;">Контент бүтээгчийн контент шаардлага хангаж брэндэд илгээгдлээ.</span></li>
                        <li><span style="white-space: pre-wrap;">Брэндийн контент засах хүсэлтийн дагуу контент бүтээгч засаж байна.</span></li>
                        <li><span style="white-space: pre-wrap;">Контент бүтээгч контентоо засаж илгээлээ.</span></li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгчийн илгээсэн контентийг Geni платформын зүгээс нэг удаагын хяналт хийдэг бөгөөд ерөнхий контентийн чанар болон стандартыг хангасан байгаа эсэхийг шалгадаг.</span></li>
                <li><span style="white-space: pre-wrap;">Geni платформын хяналтанд тэнцсэн контент брэндэд очих бөгөөд брэнд тухайн контентийг үзээд шууд хүлээн авч болно. Эсвэл засвар хийлгүүлэх хүсэлт илгээж болно.</span></li>
                <li><span style="white-space: pre-wrap;">Брэндийн контент бүтээгчдэд илгээх контент засварын хүсэлт 1 удаа илгээж болно. Ингэхдээ дээд талдаа засах шаардлагтай 3 зүйлийг нарийн тодорхой оруулсан байна.</span></li>
                <li><span style="white-space: pre-wrap;">Платформоор дамжуулан хийгдсэн контентийн оюуны өмчийг контент бүтээгч эзэмших бөгөөд хамтарсан Брэнд нь контентийг хугацаагүйгээр бүрэн ашиглах эрхтэй гэж явна.</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгчийн илгээсэн контентийг авж ашиглахаасаа өмнө тухайн контент бүтээгчийн хийсэн контентод брэнд үнэлгээ өгөх бөгөөд нэмэлтээр сэтгэгдэл илгээх боломжтой. Контентийн үнэлгээг өгөхдөө дараах 3 төрлөөр өгнө. Үүнд:</span>
                    <ol style="list-style-type: lower-alpha;">
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Брэндийн хүсэлтийн дагуу хийсэн эсэх | 1-5 од</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контентийн агуулга сайн эсэх | 1-5 од</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контентийн хийцлэл сайн эсэх | 1-5 од</span></span></li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгчдээс хүлээн авсан контентууд нь Брэндийн хаягын &ldquo;Контент&rdquo; хэсэгт байршина. Энэхүү хэсгээс Брэнд хүссэн үедээ контентуудаа үзэж татаж аван ашиглаж болно.</span></li>
                <li><span style="white-space: pre-wrap;">Брэнд нь Geni платформ дээр байршуулсан бүтээгдэхүүний мэдээлэл болон контент бүтээгчдээс хүсэх хүсэлтээ өөрөө дахин засварлах боломжтой.</span></li>
                <li><span style="white-space: pre-wrap;">Брэнд нь Geni платформын &ldquo;Бүтээгдэхүүн&rdquo; хэсгээс өөрийн байршуулсан бүтээгдэхүүний мэдээлэл болон тоо ширхэгийг харж, хянаж, нэмж, идэвхгүй болгох боломжтой.<br><br>Контент стандарт тухай:</span></li>
                <li><span style="white-space: pre-wrap;">Geni Платформоор дамжуулан контент бүтээгчдээс авах контент нь UGC буюу хэрэглэгчдийн бүтээсэн контентийн төрөлд багтах бөгөөд тус контентийн агуулга нь хэрэглэгч тухайн бүтээгдэхүүнийг бодитоор хэрэглэж үзсэн туршлага дээр үндэслэн хийгдэх болно.</span></li>
                <li><span style="white-space: pre-wrap;">Хэрэглэгчдийн бүтээсэн контент нь бодит мэдээлэл дээр үндэслэн хийгдэх ёстой бөгөөд хэт зар сурталчилгаа шиг байх ёсгүй.</span></li>
                <li><span style="white-space: pre-wrap;">Контентийн ерөнхий суурь стандартыг платформын зүгээс хянан шалгадаг. Үүнд:</span>
                    <ol style="list-style-type: lower-alpha;">
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хэмжээ: 9x16</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хугацаа: Хамгийн багадаа - 20 секунд, Хамгийн ихдээ - 1:30 секунд</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Бичиглэл: Үг үсгийн алдаа болон алдаагүй фонт байгаа эсэх.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Ая болон дуу оруулга: Хэт сул болон чанга гэх мэт алдаа байгаа эсэх.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Бичлэг чанар: Бичлэгний чанар хэт муу болон харанхуй орчинд гэх мэт тохиромжгүй зураг авалт хийсэн эсэх.</span></span></li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Брэндийн оруулсан бүтээгдэхүүний мэдээлэл болон контент бүтээгчдээс хүссэн хүсэлтийн дагуу контент бүтээгчид контентоо хийх үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Брэндийн контентоо засуулах хүсэлтийн дагуу тус контент бүтээгч дахин контентоо засаж илгээх үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгчийн засаж илгээсэн контент нь брэндийн сэтгэгдэлд хүрээгүй тохиолдолд брэнд контент бүтээгчид муу үнэлгээ өгч дүгнэх эрхтэй.</span><span style="white-space: pre-wrap;"><br><br></span><span style="white-space: pre-wrap;">Үүрэг, хариуцлага</span></li>
                <li><span style="white-space: pre-wrap;">Брэнд нь Geni платформыг ашиглах эрх бүхий төлбөрөө 100% урьдчилан төлнө.</span></li>
                <li><span style="white-space: pre-wrap;">Брэнд нь Geni платформ дээр оруулж буй бүтээгдэхүүний мэдээлэл болон контент бүтээгчээс хүсэж буй хүсэлтээ бүрэн хариуцна. Мэдээллээ дутуу оруулсанаас болж үүссэн контент гүйцэтгэлийн асуудлыг&nbsp; брэнд хариуцна.</span></li>
                <li><span style="white-space: pre-wrap;">Брэнд нь Geni платформоор дамжуулан контент бүтээгчидтэй хамтран ажиллахдаа илгээж буй бүтээгдэхүүний эвдрэл гэмтэл болон дуусах хугацааны алдангыг бүрэн хариуцна.</span></li>
                <li><span style="white-space: pre-wrap;">Брэндтэй хамтран ажиллаж буй контент бүтээгч нь контентоо өгөх хугацаа нь бүтээгдэхүүн хүргэгдэж очсоноос хойш 7 хоног байна. Харин үүнээс хойш хоцроосон тохиолдолд тохирсон хариуцлагыг Geni платформын зүгээс авна.Үүнд:</span>
                    <ol style="list-style-type: lower-alpha;">
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгчид сануулга өгөх</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгчийн оноог хасах</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгчийн бүтээгдэхүүн сонгох эрхийг тодорхой хугацаанд хаах</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгчийн хаягыг хаах</span></span></li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгч нь контентоо өгөлгүй 14-с дээш хоног болсон тохиолдолд Geni платформын зүгээс Брэндийн Geni Credit-г буцаан нөхөн олгохоос гадна Брэндийн контент бүтээгчрүү илгээсэн бүтээгдэхүүний үнийн дүнг нөхөн олгоно.</span></li>
                <li><span style="white-space: pre-wrap;">Брэнд нь контент бүтээгчийн хийсэн контентийг дүгнэж оноо өгөх үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Платформоос гадна Geni платформ дээрх контент бүтээгчидтэй хамтрахгүй байх үүрэгтэй.<br><br>Geni Контент бүтээгч<br><br>Ерөнхий зүйл:&nbsp;</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгч нь Geni Платформыг ашиглан Geni Платформ дээрх брэндүүдтэй хамтран хэрэглэгчийн бүтээсэн видео контент бүтээж ажиллах ажлын үүрэг хариуцлага болон харилцааг зохицуулахад оршино.</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгч нь Geni платформоор дамжуулан Geni платформ дээрх бүх брэнд байгууллагуудтай хамтран ажиллах боломжтой.</span></li>
                <li><span style="white-space: pre-wrap;">Geni платформ нь Контент бүтээгчийг Брэнд байгууллагуудтай хамтран ажиллахад нь жуучлах болон хоорондын харилцаа холбоог зохицуулах үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Geni платформ дээрх Брэнд байгууллагуудтай хамтран ажиллахдаа Брэндийн бараа бүтээгдэхүүнийг үнэгүй авч хэрэглэж үзсэн туршлага дээрээ тулгуурлан Брэндийн санал хүсэлтийн дагуу контент бүтээх ёстой.<br><br>Платформ ашиглах тухай:</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгч нь Geni платформ дээр өөрийн албан ёсны хаягыг үүсгэн Geni платформ дээрх брэндүүдтэй хамтрах боломжтой.</span></li>
                <li><span style="white-space: pre-wrap;">Geni платформ дээрх хэрэглэгчийн хувийн мэдээллийн аюулгүй байдлыг Geni платформын зүгээс хангах үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Платформоор дамжуулан хийгдсэн контентийн оюуны өмчийг контент бүтээгч эзэмших бөгөөд хамтарсан Брэнд нь контентийг хугацаагүйгээр бүрэн ашиглах эрхтэй гэж явна.</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгч нь тухайн брэндийн бараа бүтээгдэхүүнийг авах хүсэлт илгээсэн үед брэндийн оруулсан санал хүсэлтийг хүлээн зөвшөөрч байгаа гэж үзнэ.</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгч нь хүссэн бараа бүтээгдэхүүнээ хүргэгдэж очсоноос эхлэн 7 хоногийн хугацаанд эргүүлэн контент илгээх үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Хүргэгдсэн бүтээгдэхүүнийг контент бүтээгч нь дараах нөхцөлүүдээр буцаах эрхтэй.</span>
                    <ol style="list-style-type: lower-alpha;">
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Бүтээгдэхүүн эвдэрсэн</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Бүтээгдэхүүний хугацаа дууссан</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Бүтээгдэхүүний хэмжээ зөрсөн</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Буруу бүтээгдэхүүн ирсэн</span></span></li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Бүтээгдэхүүний хүсэлтээ илгээхдээ бүтээгдэхүүн хүргүүлэх хаягийн мэдээллийг сайтар хянаж хүргэлтийн төлбөрийг төлнө.</span></li>
                <li><span style="white-space: pre-wrap;">Буруу хаяг оруулсан болон хүргэлт авах хүн байгаагүйгээс үүдсэн асуудлыг Geni платформ хариуцахгүй.</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгч нь платформ дээрх брэндтэй платформоос гадуур хамтран ажиллахгүй байх үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгчдийн хүсэлтийг Geni платформоос хүлээн зөвшөөрсөнөөс эхлэн контент брэндэд очих хүртэлх бүх процессийг платформоор дамжуулан хянана. Үүнд дараах төлөвүүд орно:</span>
                    <ol style="list-style-type: lower-alpha;">
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Бүтээгдэхүүний хүсэлт илгээгдсэн</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Бүтээгдэхүүн контент бүтээгчид хүргэгдэж байна.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгч бүтээгдэхүүнийг хүлээн авсан.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгч контентоо хийж байна.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгч контентоо илгээлээ.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгчийн контентийг Geni платформын зүгээс шалгаж байна.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгчийн контент шаардлага хангаагүй тул засварлаж байна.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгчийн контент шаардлага хангаж брэндэд илгээгдлээ.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Брэндийн контент засах хүсэлтийн дагуу контент бүтээгч засаж байна.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент бүтээгч контентоо засаж илгээлээ.</span></span></li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгчийн илгээсэн контентийг Geni платформын зүгээс нэг удаагын хяналт хийдэг бөгөөд ерөнхий контентийн чанар болон стандартыг хангасан байгаа эсэхийг шалгадаг.</span></li>
                <li><span style="white-space: pre-wrap;">Geni платформын хяналтанд тэнцсэн контент брэндэд очих бөгөөд брэнд тухайн контентийг үзээд шууд хүлээн авч болно. Эсвэл засвар хийлгүүлэх хүсэлт илгээж болно.</span></li>
                <li><span style="white-space: pre-wrap;">Брэндийн контент бүтээгчдэд илгээх контент засварын хүсэлт 1 удаа илгээж болно. Ингэхдээ дээд талдаа засах шаардлагтай 3 зүйлийг нарийн тодорхой оруулсан байна.</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгчийн илгээсэн контентийг авж ашиглахаасаа өмнө тухайн контент бүтээгчийн хийсэн контентод брэнд үнэлгээ өгөх бөгөөд нэмэлтээр сэтгэгдэл илгээх боломжтой. Контентийн үнэлгээг өгөхдөө дараах 3 төрлөөр өгнө. Үүнд:<br></span>
                    <ol style="list-style-type: lower-alpha;">
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Брэндийн хүсэлтийн дагуу хийсэн эсэх | 1-5 од</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контентийн агуулга сайн эсэх | 1-5 од</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контентийн хийцлэл сайн эсэх | 1-5 од</span></span></li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Брэндийн контент бүтээгчид өгсөн үнэлгээ нь дараах байдлаар контент бүтээгчид XP оноо болон тооцогдож орно.<br></span>
                    <ol style="list-style-type: lower-alpha;">
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">1 од - 0 XP</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">2 од - 10 XP</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">3 од - 30 XP</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">4 од - 80 XP</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">5 од - 100 XP</span></span></li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Брэндүүдийн үнэлгээгээр цуглуулсан XP оноо нь дараах түвшингүүдэд хүрэхэд хамаарах бөгөөд контент бүтээгч түвшин ахиулах зарчмаар нэмэлт урамшуулал хүртэх боломжтой. Үүнд<br></span>
                    <ol style="list-style-type: lower-alpha;">
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">100 XP оноо - Certified creator түвшин</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">1&rsquo;000 XP оноо - Pro creator bronze түвшин</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">5&rsquo;000 XP оноо - Pro creator silver түвшин</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">15&rsquo;000 XP оноо - Pro creator gold түвшин</span></span></li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Контент илгээх хугацааг 4 төлөвт авж үзэх бөгөөд хугацаа хоцорсон <br>тохиолдолд дараах арга хэмжээнүүдийг үе шаттайгаар авна. Үүнд:<br></span>
                    <ol>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хэвийн төлөв | Бүтээгдэхүүн хүргэгдэж очсоноос 1-7 хоног</span></span>
                            <ol style="list-style-type: lower-roman;">
                                <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">5 дахь хоног дээр сануулга мэдэгдэл очно</span></span></span></li>
                                <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">7 дахь хоног дээр сануулга мэдэгдэл очно</span></span></span></li>
                            </ol>
                        </li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хөнгөн төлөв | Контент өгөх хугацаанаас хойш 1-7 хоног</span></span>
                            <ol style="list-style-type: lower-roman;">
                                <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хоцорсон 1-3 хоногт хоног тутам 5XP оноо хасагдана</span></span></span></li>
                                <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хоцорсон 4-7 хоногт хоног тутам 10XP оноо хасагдана</span></span></span></li>
                            </ol>
                        </li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хүнд нөхцөл | Контент өгөх хугацаанаас хойш 8-28 хоног</span></span>
                            <ol style="list-style-type: lower-roman;">
                                <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Төлбөрийн нэхэмжлэх илгээгдэнэ: Тухайн авсан бараа бүтээгдэхүүний үнийн дүнг 2 нугалж төлнө</span></span></span></li>
                                <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Нэхэмжлэх төлсөний дараа бүтээгдэхүүн сонгох эрхийг нэхэмжлэх төлөөгүй хугацаагаар хаана</span></span></span></li>
                            </ol>
                        </li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хурц хөнцөл | Нэхэмжлэх төлөөгүй 28 хоногоос дээш</span></span>
                            <ol style="list-style-type: lower-roman;">
                                <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хаягыг хааж, Гэрээ цуцлана</span></span><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Контент стандарт тухай:</span></span></li>
                            </ol>
                        </li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Geni Платформоор дамжуулан контент бүтээгчийн бүтээх контент нь UGC буюу хэрэглэгчдийн бүтээсэн контентийн төрөлд багтах бөгөөд тус контентийн агуулга нь хэрэглэгч тухайн бүтээгдэхүүнийг бодитоор хэрэглэж үзсэн туршлага дээр үндэслэн хийгдэх болно.</span></li>
                <li><span style="white-space: pre-wrap;">Хэрэглэгчдийн бүтээсэн контент нь бодит мэдээлэл дээр үндэслэн хийгдэх ёстой бөгөөд хэт зар сурталчилгаа шиг байх ёсгүй.</span></li>
                <li><span style="white-space: pre-wrap;">Контентийн ерөнхий суурь стандартыг платформын зүгээс хянан шалгадаг. Үүнд:</span>
                    <ol style="list-style-type: lower-alpha;">
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хэмжээ: 9x16</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Хугацаа: Хамгийн багадаа - 20 секунд, Хамгийн ихдээ - 1:30 секунд</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Бичиглэл: Үг үсгийн алдаа болон алдаагүй фонт байгаа эсэх.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Ая болон дуу оруулга: Хэт сул болон чанга гэх мэт алдаа байгаа эсэх.</span></span></li>
                        <li><span style="white-space: pre-wrap;"><span style="white-space: pre-wrap;">Бичлэг чанар: Бичлэгний чанар хэт муу болон харанхуй орчинд гэх мэт тохиромжгүй зураг авалт хийсэн эсэх.</span></span></li>
                    </ol>
                </li>
                <li><span style="white-space: pre-wrap;">Брэндийн оруулсан бүтээгдэхүүний мэдээлэл болон контент бүтээгчдээс хүссэн хүсэлтийн дагуу контент бүтээгчид контентоо хийх үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Брэндийн контентоо засуулах хүсэлтийн дагуу тус контент бүтээгч дахин контентоо засаж илгээх үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгчийн засаж илгээсэн контент нь брэндийн сэтгэгдэлд хүрээгүй тохиолдолд брэнд контент бүтээгчид муу үнэлгээ өгч дүгнэх эрхтэй.<br><br>Geni Сурагч<br><br>Ерөнхий зүйл:&nbsp;</span></li>
                <li><span style="white-space: pre-wrap;">Geni Сурагч нь Geni Платформыг ашиглан Geni сурагчын хөтөлбөрийн видео хичээлүүдийг худалдан авч үзэх болон хөтөлбөрийн даалгавар контентийг хийж илгээхэд ашиглана.<br><br>Платформ ашиглах тухай:</span></li>
                <li><span style="white-space: pre-wrap;">Контент бүтээгч нь Geni платформ дээр өөрийн албан ёсны хаягыг үүсгэн Geni Сурагчын хөтөлбөрийг худалдан авч, үзэх боломжтой.</span></li>
                <li><span style="white-space: pre-wrap;">Geni платформ дээрх хэрэглэгчийн хувийн мэдээллийн аюулгүй байдлыг Geni платформын зүгээс хангах үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Сурагч нь өөрийн хурдаар хичээлүүдээ үзэн хүссэн үедээ даалгавар контентоо илгээх боломжтой.</span></li>
                <li><span style="white-space: pre-wrap;">Хөтөлбөрийн төлбөрийг буцаан төлөх боломжгүй.</span></li>
                <li><span style="white-space: pre-wrap;">Платформоор дамжуулан хөтөлбөрийн даалгаварыг илгээх бөгөөд уг даалгавар дээр Geni платформын зүгээс зөвлөгөө өгөх үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Сурагч нь даалгавар дээр өгсөн зөвлөгөөний дагуу дахин даалгавар хийн илгээх үүрэгтэй.</span></li>
                <li><span style="white-space: pre-wrap;">Сурагчын даалгавар Geni платформын шалгуурыг хангасан тохиолдолд албан ёсны Контент бүтээгч болох боломжтой.</span></li>
                <li><span style="white-space: pre-wrap;">Сурагчын даалгавар тэнцсэнээр Албан ёсны контент бүтээгчийн хаягтай болж Брэндүүдтэй хамтрах эрхийг Geni Платформоос нээж өгөх үүрэгтэй.</span></li>
            </ol>
            </body>
            </html>
`,
        }}
      ></div>
      {/* <div className="mt-12">
        <p>Geni Брэнд</p>
        <p>Ерөнхий зүйл:</p>
        <ol start={1}>
          <li>
            Байгууллага буюу брэнд нь Geni Платформыг ашиглан Geni Платформ
            дээрх контент бүтээгчидтэй хамтран хэрэглэгчийн бүтээсэн видео
            контент бүтээж ажиллах ажлын үүрэг хариуцлага болон харилцааг
            зохицуулахад оршино.
          </li>
          <li>
            Брэнд нь Geni платформоор дамжуулан Geni платформ дээрх бүх контент
            бүтээгчидтэй хамтран ажиллах боломжтой.
          </li>
          <li>
            Geni платформ нь Брэндийг контент бүтээгчидтэй хамтран ажиллахад нь
            жуучлах болон хоорондын харилцаа холбоог зохицуулах үүрэгтэй.
          </li>
          <li>
            Geni платформ дээрх контент бүтээгчидтэй хамтран ажиллахдаа
            бүтээгдэхүүнээ контент бүтээгчдэд санал болгох үүднээс Geni
            платформруу илгээх ёстой бөгөөд энэ нь контент бүтээгчийн контентоо
            бүтээхэд зориулсан урсгал зардал гэж тооцогдоно.
          </li>
        </ol>
        <p>Платформ ашиглах тухай:</p>
        <ol start={1}>
          <li>
            Брэнд нь Geni платформ дээр өөрийн албан ёсны хаягыг үүсгэн Geni
            платформ дээрх контент бүтээгчидтэй хамтрах боломжтой.
          </li>
          <li>
            Geni платформоор дамжуулан контент бүтээгчидтэй хамтран ажиллахдаа
            контент бүтээгчидтэй хамтран ажиллах эрх буюу &ldquo;Geni
            Credit&rdquo;-г идэвхжүүлж цэнэглэсний дараа контент бүтээгчидтэй
            хамтрах эрхтэй болно.
          </li>
          <li>
            Брэнд нь &ldquo;Geni Credit&rdquo;-н тоогоор бүтээгчидтэй хамтрах
            эрхтэй болох бөгөөд 4 төрлийн багцтай. Тухайн багцаас хамааран
            &ldquo;Geni Credit&rdquo;-н тоо болон үнийн дүн харилцан өөр өөр
            байна.
          </li>
        </ol>
        <ol start={1}>
          <li>
            Geni credit: 3 ширхэг - Нэгж үнэ: 250&rsquo;000₮ - Нийт үнэ:
            750&rsquo;000₮
          </li>
          <li>
            Geni credit: 8 ширхэг - Нэгж үнэ: 230&rsquo;000₮ - Нийт үнэ:
            1&rsquo;840&rsquo;000₮
          </li>
          <li>
            Geni credit: 15 ширхэг - Нэгж үнэ: 210&rsquo;000₮ - Нийт үнэ:
            3&rsquo;150&rsquo;000₮
          </li>
          <li>
            Geni credit: 30 ширхэг - Нэгж үнэ: 190&rsquo;000₮ - Нийт үнэ:
            5&rsquo;700&rsquo;000₮
          </li>
        </ol>
        <ol start={4}>
          <li>
            &ldquo;Geni Credit&rdquo; дууссан тохиолдолд Geni платформыг ашиглан
            хүссэн үедээ дахин цэнэглэж ашиглах боломжтой
          </li>
          <li>
            Брэнд нь &ldquo;Geni Credit&rdquo;-н цэнэглэсэн тоогоо ашиглан Geni
            платформ дээр өөрсдийн бараа бүтээгдэхүүний мэдээллээ болон ямар
            агуулгатай контент контент бүтээгчдээс авмаар байгаа хүсэлтээ
            ойлгомжтой сайн бичиж илгээх шаардлагатай бөгөөд уг бичсэн илгээсэн
            хүсэлтийн дагуу контент бүтээгчид контентоо хийж илгээх юм.
          </li>
          <li>
            Бүтээгдэхүүний хүсэлтээ илгээхдээ нэг контент бүтээгчид хамгийн
            багадаа 30&rsquo;000 төгрөгний үнэ бүхий бүтээгдэхүүнийг санал
            болгоно. Энэ нь контент бүтээгчдийн сэтгэл ханамжыг хангахад
            зориулагдана.
          </li>
          <li>
            Бүтээгдэхүүний мэдээлэл илгээсний дараа оруулсан мэдээллийн дагуу
            бүтээгдэхүүнээ Geni платформ-н агуулахруу хүргүүлэх үүрэгтэй.
          </li>
          <li>
            Geni платформын зүгээс бараа бүтээгдэхүүний илгээсэн мэдээллийг
            шалгасны дараагаар албан ёсоор платформ дээр бүтээгдэхүүний мэдээлэл
            байршина.
          </li>
          <li>
            Geni платформ дээр бүтээгдэхүүний мэдээлэл байршсаны дараагаар
            тухайн бүтээгдэхүүнийг авч контент бүтээх хүсэлтээ контент бүтээгчид
            Geni платформ луу илгээнэ.
          </li>
          <li>
            Контент бүтээгчдийн хүсэлтийг Geni платформоос хүлээн зөвшөөрсөнөөс
            эхлэн контент брэндэд очих хүртэлх бүх процессийг платформоор
            дамжуулан хянана. Үүнд дараах төлөвүүд орно:
          </li>
        </ol>
        <ol start={1}>
          <li>Бүтээгдэхүүн контент бүтээгчид хүргэгдэж байна.</li>
          <li>Контент бүтээгч бүтээгдэхүүнийг хүлээн авсан.</li>
          <li>Контент бүтээгч контентоо хийж байна.</li>
          <li>Контент бүтээгч контентоо илгээлээ.</li>
          <li>
            Контент бүтээгчийн контентийг Geni платформын зүгээс шалгаж байна.
          </li>
          <li>
            Контент бүтээгчийн контент шаардлага хангаагүй тул засварлаж байна.
          </li>
          <li>
            Контент бүтээгчийн контент шаардлага хангаж брэндэд илгээгдлээ.
          </li>
          <li>
            Брэндийн контент засах хүсэлтийн дагуу контент бүтээгч засаж байна.
          </li>
          <li>Контент бүтээгч контентоо засаж илгээлээ.</li>
        </ol>
        <ol start={11}>
          <li>
            Контент бүтээгчийн илгээсэн контентийг Geni платформын зүгээс нэг
            удаагын хяналт хийдэг бөгөөд ерөнхий контентийн чанар болон
            стандартыг хангасан байгаа эсэхийг шалгадаг.
          </li>
          <li>
            Geni платформын хяналтанд тэнцсэн контент брэндэд очих бөгөөд брэнд
            тухайн контентийг үзээд шууд хүлээн авч болно. Эсвэл засвар
            хийлгүүлэх хүсэлт илгээж болно.
          </li>
          <li>
            Брэндийн контент бүтээгчдэд илгээх контент засварын хүсэлт 1 удаа
            илгээж болно. Ингэхдээ дээд талдаа засах шаардлагтай 3 зүйлийг
            нарийн тодорхой оруулсан байна.
          </li>
          <li>
            Платформоор дамжуулан хийгдсэн контентийн оюуны өмчийг контент
            бүтээгч эзэмших бөгөөд хамтарсан Брэнд нь контентийг хугацаагүйгээр
            бүрэн ашиглах эрхтэй гэж явна.
          </li>
          <li>
            Контент бүтээгчийн илгээсэн контентийг авж ашиглахаасаа өмнө тухайн
            контент бүтээгчийн хийсэн контентод брэнд үнэлгээ өгөх бөгөөд
            нэмэлтээр сэтгэгдэл илгээх боломжтой. Контентийн үнэлгээг өгөхдөө
            дараах 3 төрлөөр өгнө. Үүнд:
          </li>
        </ol>
        <ol start={1}>
          <li>Брэндийн хүсэлтийн дагуу хийсэн эсэх | 1-5 од</li>
          <li>Контентийн агуулга сайн эсэх | 1-5 од</li>
          <li>Контентийн хийцлэл сайн эсэх | 1-5 од</li>
        </ol>
        <ol start={16}>
          <li>
            Контент бүтээгчдээс хүлээн авсан контентууд нь Брэндийн хаягын
            &ldquo;Контент&rdquo; хэсэгт байршина. Энэхүү хэсгээс Брэнд хүссэн
            үедээ контентуудаа үзэж татаж аван ашиглаж болно.
          </li>
          <li>
            Брэнд нь Geni платформ дээр байршуулсан бүтээгдэхүүний мэдээлэл
            болон контент бүтээгчдээс хүсэх хүсэлтээ өөрөө дахин засварлах
            боломжтой.
          </li>
          <li>
            Брэнд нь Geni платформын &ldquo;Бүтээгдэхүүн&rdquo; хэсгээс өөрийн
            байршуулсан бүтээгдэхүүний мэдээлэл болон тоо ширхэгийг харж, хянаж,
            нэмж, идэвхгүй болгох боломжтой.
          </li>
        </ol>
        <p>Контент стандарт тухай:</p>
        <ol start={1}>
          <li>
            Geni Платформоор дамжуулан контент бүтээгчдээс авах контент нь UGC
            буюу хэрэглэгчдийн бүтээсэн контентийн төрөлд багтах бөгөөд тус
            контентийн агуулга нь хэрэглэгч тухайн бүтээгдэхүүнийг бодитоор
            хэрэглэж үзсэн туршлага дээр үндэслэн хийгдэх болно.
          </li>
          <li>
            Хэрэглэгчдийн бүтээсэн контент нь бодит мэдээлэл дээр үндэслэн
            хийгдэх ёстой бөгөөд хэт зар сурталчилгаа шиг байх ёсгүй.
          </li>
          <li>
            Контентийн ерөнхий суурь стандартыг платформын зүгээс хянан
            шалгадаг. Үүнд:
          </li>
        </ol>
        <ol start={1}>
          <li>Хэмжээ: 9x16</li>
          <li>
            Хугацаа: Хамгийн багадаа - 20 секунд, Хамгийн ихдээ - 1:30 секунд
          </li>
          <li>Бичиглэл: Үг үсгийн алдаа болон алдаагүй фонт байгаа эсэх.</li>
          <li>
            Ая болон дуу оруулга: Хэт сул болон чанга гэх мэт алдаа байгаа эсэх.
          </li>
          <li>
            Бичлэг чанар: Бичлэгний чанар хэт муу болон харанхуй орчинд гэх мэт
            тохиромжгүй зураг авалт хийсэн эсэх.
          </li>
        </ol>
        <ol start={4}>
          <li>
            Брэндийн оруулсан бүтээгдэхүүний мэдээлэл болон контент бүтээгчдээс
            хүссэн хүсэлтийн дагуу контент бүтээгчид контентоо хийх үүрэгтэй.
          </li>
          <li>
            Брэндийн контентоо засуулах хүсэлтийн дагуу тус контент бүтээгч
            дахин контентоо засаж илгээх үүрэгтэй.
          </li>
          <li>
            Контент бүтээгчийн засаж илгээсэн контент нь брэндийн сэтгэгдэлд
            хүрээгүй тохиолдолд брэнд контент бүтээгчид муу үнэлгээ өгч дүгнэх
            эрхтэй.
          </li>
        </ol>
        <p>Үүрэг, хариуцлага</p>
        <ol start={1}>
          <li>
            Брэнд нь Geni платформыг ашиглах эрх бүхий төлбөрөө 100% урьдчилан
            төлнө.
          </li>
          <li>
            Брэнд нь Geni платформ дээр оруулж буй бүтээгдэхүүний мэдээлэл болон
            контент бүтээгчээс хүсэж буй хүсэлтээ бүрэн хариуцна. Мэдээллээ
            дутуу оруулсанаас болж үүссэн контент гүйцэтгэлийн асуудлыг брэнд
            хариуцна.
          </li>
          <li>
            Брэнд нь Geni платформоор дамжуулан контент бүтээгчидтэй хамтран
            ажиллахдаа илгээж буй бүтээгдэхүүний эвдрэл гэмтэл болон дуусах
            хугацааны алдангыг бүрэн хариуцна.
          </li>
          <li>
            Брэндтэй хамтран ажиллаж буй контент бүтээгч нь контентоо өгөх
            хугацаа нь бүтээгдэхүүн хүргэгдэж очсоноос хойш 7 хоног байна. Харин
            үүнээс хойш хоцроосон тохиолдолд тохирсон хариуцлагыг Geni
            платформын зүгээс авна.Үүнд:
          </li>
        </ol>
        <ol start={1}>
          <li>Контент бүтээгчид сануулга өгөх</li>
          <li>Контент бүтээгчийн оноог хасах</li>
          <li>
            Контент бүтээгчийн бүтээгдэхүүн сонгох эрхийг тодорхой хугацаанд
            хаах
          </li>
          <li>Контент бүтээгчийн хаягыг хаах</li>
        </ol>
        <ol start={5}>
          <li>
            Контент бүтээгч нь контентоо өгөлгүй 14-с дээш хоног болсон
            тохиолдолд Geni платформын зүгээс Брэндийн Geni Credit-г буцаан
            нөхөн олгохоос гадна Брэндийн контент бүтээгчрүү илгээсэн
            бүтээгдэхүүний үнийн дүнг нөхөн олгоно.
          </li>
          <li>
            Брэнд нь контент бүтээгчийн хийсэн контентийг дүгнэж оноо өгөх
            үүрэгтэй.
          </li>
          <li>
            Платформоос гадна Geni платформ дээрх контент бүтээгчидтэй
            хамтрахгүй байх үүрэгтэй.
          </li>
        </ol>
        <p>Geni Контент бүтээгч</p>
        <p>Ерөнхий зүйл:</p>
        <ol start={1}>
          <li>
            Контент бүтээгч нь Geni Платформыг ашиглан Geni Платформ дээрх
            брэндүүдтэй хамтран хэрэглэгчийн бүтээсэн видео контент бүтээж
            ажиллах ажлын үүрэг хариуцлага болон харилцааг зохицуулахад оршино.
          </li>
          <li>
            Контент бүтээгч нь Geni платформоор дамжуулан Geni платформ дээрх
            бүх брэнд байгууллагуудтай хамтран ажиллах боломжтой.
          </li>
          <li>
            Geni платформ нь Контент бүтээгчийг Брэнд байгууллагуудтай хамтран
            ажиллахад нь жуучлах болон хоорондын харилцаа холбоог зохицуулах
            үүрэгтэй.
          </li>
          <li>
            Geni платформ дээрх Брэнд байгууллагуудтай хамтран ажиллахдаа
            Брэндийн бараа бүтээгдэхүүнийг үнэгүй авч хэрэглэж үзсэн туршлага
            дээрээ тулгуурлан Брэндийн санал хүсэлтийн дагуу контент бүтээх
            ёстой.
          </li>
        </ol>
        <p>Платформ ашиглах тухай:</p>
        <ol start={1}>
          <li>
            Контент бүтээгч нь Geni платформ дээр өөрийн албан ёсны хаягыг
            үүсгэн Geni платформ дээрх брэндүүдтэй хамтрах боломжтой.
          </li>
          <li>
            Geni платформ дээрх хэрэглэгчийн хувийн мэдээллийн аюулгүй байдлыг
            Geni платформын зүгээс хангах үүрэгтэй.
          </li>
          <li>
            Платформоор дамжуулан хийгдсэн контентийн оюуны өмчийг контент
            бүтээгч эзэмших бөгөөд хамтарсан Брэнд нь контентийг хугацаагүйгээр
            бүрэн ашиглах эрхтэй гэж явна.
          </li>
          <li>
            Контент бүтээгч нь тухайн брэндийн бараа бүтээгдэхүүнийг авах хүсэлт
            илгээсэн үед брэндийн оруулсан санал хүсэлтийг хүлээн зөвшөөрч
            байгаа гэж үзнэ.
          </li>
          <li>
            Контент бүтээгч нь хүссэн бараа бүтээгдэхүүнээ хүргэгдэж очсоноос
            эхлэн 7 хоногийн хугацаанд эргүүлэн контент илгээх үүрэгтэй.
          </li>
          <li>
            Хүргэгдсэн бүтээгдэхүүнийг контент бүтээгч нь дараах нөхцөлүүдээр
            буцаах эрхтэй.
          </li>
        </ol>
        <ol start={1}>
          <li>Бүтээгдэхүүн эвдэрсэн</li>
          <li>Бүтээгдэхүүний хугацаа дууссан</li>
          <li>Бүтээгдэхүүний хэмжээ зөрсөн</li>
          <li>Буруу бүтээгдэхүүн ирсэн</li>
        </ol>
        <ol start={7}>
          <li>
            Бүтээгдэхүүний хүсэлтээ илгээхдээ бүтээгдэхүүн хүргүүлэх хаягийн
            мэдээллийг сайтар хянаж хүргэлтийн төлбөрийг төлнө.
          </li>
          <li>
            Буруу хаяг оруулсан болон хүргэлт авах хүн байгаагүйгээс үүдсэн
            асуудлыг Geni платформ хариуцахгүй.
          </li>
          <li>
            Контент бүтээгч нь платформ дээрх брэндтэй платформоос гадуур
            хамтран ажиллахгүй байх үүрэгтэй.
          </li>
          <li>
            Контент бүтээгчдийн хүсэлтийг Geni платформоос хүлээн зөвшөөрсөнөөс
            эхлэн контент брэндэд очих хүртэлх бүх процессийг платформоор
            дамжуулан хянана. Үүнд дараах төлөвүүд орно:
          </li>
        </ol>
        <ol start={1}>
          <li>Бүтээгдэхүүний хүсэлт илгээгдсэн</li>
          <li>Бүтээгдэхүүн контент бүтээгчид хүргэгдэж байна.</li>
          <li>Контент бүтээгч бүтээгдэхүүнийг хүлээн авсан.</li>
          <li>Контент бүтээгч контентоо хийж байна.</li>
          <li>Контент бүтээгч контентоо илгээлээ.</li>
          <li>
            Контент бүтээгчийн контентийг Geni платформын зүгээс шалгаж байна.
          </li>
          <li>
            Контент бүтээгчийн контент шаардлага хангаагүй тул засварлаж байна.
          </li>
          <li>
            Контент бүтээгчийн контент шаардлага хангаж брэндэд илгээгдлээ.
          </li>
          <li>
            Брэндийн контент засах хүсэлтийн дагуу контент бүтээгч засаж байна.
          </li>
          <li>Контент бүтээгч контентоо засаж илгээлээ.</li>
        </ol>
        <ol start={11}>
          <li>
            Контент бүтээгчийн илгээсэн контентийг Geni платформын зүгээс нэг
            удаагын хяналт хийдэг бөгөөд ерөнхий контентийн чанар болон
            стандартыг хангасан байгаа эсэхийг шалгадаг.
          </li>
          <li>
            Geni платформын хяналтанд тэнцсэн контент брэндэд очих бөгөөд брэнд
            тухайн контентийг үзээд шууд хүлээн авч болно. Эсвэл засвар
            хийлгүүлэх хүсэлт илгээж болно.
          </li>
          <li>
            Брэндийн контент бүтээгчдэд илгээх контент засварын хүсэлт 1 удаа
            илгээж болно. Ингэхдээ дээд талдаа засах шаардлагтай 3 зүйлийг
            нарийн тодорхой оруулсан байна.
          </li>
          <li>
            Контент бүтээгчийн илгээсэн контентийг авж ашиглахаасаа өмнө тухайн
            контент бүтээгчийн хийсэн контентод брэнд үнэлгээ өгөх бөгөөд
            нэмэлтээр сэтгэгдэл илгээх боломжтой. Контентийн үнэлгээг өгөхдөө
            дараах 3 төрлөөр өгнө. Үүнд:
          </li>
        </ol>
        <ol start={1}>
          <li>Брэндийн хүсэлтийн дагуу хийсэн эсэх | 1-5 од</li>
          <li>Контентийн агуулга сайн эсэх | 1-5 од</li>
          <li>Контентийн хийцлэл сайн эсэх | 1-5 од</li>
        </ol>
        <ol start={15}>
          <li>
            Брэндийн контент бүтээгчид өгсөн үнэлгээ нь дараах байдлаар контент
            бүтээгчид XP оноо болон тооцогдож орно.
          </li>
        </ol>
        <ol start={1}>
          <li>1 од - 0 XP</li>
          <li>2 од - 10 XP</li>
          <li>3 од - 30 XP</li>
          <li>4 од - 80 XP</li>
          <li>5 од - 100 XP</li>
        </ol>
        <ol start={16}>
          <li>
            Брэндүүдийн үнэлгээгээр цуглуулсан XP оноо нь дараах түвшингүүдэд
            хүрэхэд хамаарах бөгөөд контент бүтээгч түвшин ахиулах зарчмаар
            нэмэлт урамшуулал хүртэх боломжтой. Үүнд
          </li>
        </ol>
        <ol start={1}>
          <li>100 XP оноо - Certified creator түвшин</li>
          <li>1&rsquo;000 XP оноо - Pro creator bronze түвшин</li>
          <li>10&rsquo;000 XP оноо - Pro creator silver түвшин</li>
          <li>50&rsquo;000 XP оноо - Pro creator gold түвшин</li>
        </ol>
        <ol start={17}>
          <li>
            Контент бүтээгчдийн түвшингээс хамааран хамтрал бүрээс авах
            урамшуулал нь харилцан өөр байна. Мөн хамтрал бүрээс авах урамшуулал
            нь тухайн хамтрал дээр контент бүтээгчид өгсөн Брэндийн үнэлгээнээс
            хамаарна.
          </li>
        </ol>
        <ol start={1}>
          <li>Certified creator түвшин урамшуулал авахгүй</li>
          <li>Pro creator bronze түвшин</li>
        </ol>
        <ol start={1}>
          <li>1 од - 0 урамшуулал</li>
          <li>2 од - 0 урамшуулал</li>
          <li>3 од - 18&rsquo;000 төгрөг урамшуулал</li>
          <li>4 од - 24&rsquo;000 төгрөг урамшуулал</li>
          <li>5 од - 30&rsquo;000 төгрөг урамшуулал</li>
        </ol>
        <ol start={3}>
          <li>Pro creator silver түвшин</li>
        </ol>
        <ol start={1}>
          <li>1 од - 0 урамшуулал</li>
          <li>2 од - 0 урамшуулал</li>
          <li>3 од - 30&rsquo;000 төгрөг урамшуулал</li>
          <li>4 од - 40&rsquo;000 төгрөг урамшуулал</li>
          <li>5 од - 50&rsquo;000 төгрөг урамшуулал</li>
        </ol>
        <ol start={4}>
          <li>Pro creator gold түвшин</li>
        </ol>
        <ol start={1}>
          <li>1 од - 0 урамшуулал</li>
          <li>2 од - 0 урамшуулал</li>
          <li>3 од - 48&rsquo;000 төгрөг урамшуулал</li>
          <li>4 од - 64&rsquo;000 төгрөг урамшуулал</li>
          <li>5 од - 80&rsquo;000 төгрөг урамшуулал</li>
        </ol>
        <ol start={18}>
          <li>
            Контент илгээх хугацааг 4 төлөвт авж үзэх бөгөөд хугацаа хоцорсон
            тохиолдолд дараах арга хэмжээнүүдийг үе шаттайгаар авна. Үүнд:
          </li>
        </ol>
        <ol start={1}>
          <li>Хэвийн төлөв | Бүтээгдэхүүн хүргэгдэж очсоноос 1-7 хоног</li>
        </ol>
        <ol start={1}>
          <li>5 дахь хоног дээр сануулга мэдэгдэл очно</li>
          <li>7 дахь хоног дээр сануулга мэдэгдэл очно</li>
        </ol>
        <ol start={2}>
          <li>Хөнгөн төлөв | Контент өгөх хугацаанаас хойш 1-7 хоног</li>
        </ol>
        <ol start={1}>
          <li>Хоцорсон 1-3 хоногт хоног тутам 5XP оноо хасагдана</li>
          <li>Хоцорсон 4-7 хоногт хоног тутам 10XP оноо хасагдана</li>
        </ol>
        <ol start={3}>
          <li>Хүнд нөхцөл | Контент өгөх хугацаанаас хойш 8-28 хоног</li>
        </ol>
        <ol start={1}>
          <li>
            Төлбөрийн нэхэмжлэх илгээгдэнэ: Тухайн авсан бараа бүтээгдэхүүний
            үнийн дүнг 2 нугалж төлнө
          </li>
          <li>
            Нэхэмжлэх төлсөний дараа бүтээгдэхүүн сонгох эрхийг нэхэмжлэх
            төлөөгүй хугацаагаар хаана
          </li>
        </ol>
        <ol start={4}>
          <li>Хурц нөхцөл | Нэхэмжлэх төлөөгүй 28 хоногоос дээш</li>
        </ol>
        <ol start={1}>
          <li>Хаягыг хааж, Гэрээ цуцлана</li>
        </ol>
        <p>Контент стандарт тухай:</p>
        <ol start={1}>
          <li>
            Geni Платформоор дамжуулан контент бүтээгчийн бүтээх контент нь UGC
            буюу хэрэглэгчдийн бүтээсэн контентийн төрөлд багтах бөгөөд тус
            контентийн агуулга нь хэрэглэгч тухайн бүтээгдэхүүнийг бодитоор
            хэрэглэж үзсэн туршлага дээр үндэслэн хийгдэх болно.
          </li>
          <li>
            Хэрэглэгчдийн бүтээсэн контент нь бодит мэдээлэл дээр үндэслэн
            хийгдэх ёстой бөгөөд хэт зар сурталчилгаа шиг байх ёсгүй.
          </li>
          <li>
            Контентийн ерөнхий суурь стандартыг платформын зүгээс хянан
            шалгадаг. Үүнд:
          </li>
        </ol>
        <ol start={1}>
          <li>Хэмжээ: 9x16</li>
          <li>
            Хугацаа: Хамгийн багадаа - 20 секунд, Хамгийн ихдээ - 1:30 секунд
          </li>
          <li>Бичиглэл: Үг үсгийн алдаа болон алдаагүй фонт байгаа эсэх.</li>
          <li>
            Ая болон дуу оруулга: Хэт сул болон чанга гэх мэт алдаа байгаа эсэх.
          </li>
          <li>
            Бичлэг чанар: Бичлэгний чанар хэт муу болон харанхуй орчинд гэх мэт
            тохиромжгүй зураг авалт хийсэн эсэх.
          </li>
        </ol>
        <ol start={4}>
          <li>
            Брэндийн оруулсан бүтээгдэхүүний мэдээлэл болон контент бүтээгчдээс
            хүссэн хүсэлтийн дагуу контент бүтээгчид контентоо хийх үүрэгтэй.
          </li>
          <li>
            Брэндийн контентоо засуулах хүсэлтийн дагуу тус контент бүтээгч
            дахин контентоо засаж илгээх үүрэгтэй.
          </li>
          <li>
            Контент бүтээгчийн засаж илгээсэн контент нь брэндийн сэтгэгдэлд
            хүрээгүй тохиолдолд брэнд контент бүтээгчид муу үнэлгээ өгч дүгнэх
            эрхтэй.
          </li>
        </ol>
        <p>Geni Сурагч</p>
        <p>Ерөнхий зүйл:</p>
        <ol start={1}>
          <li>
            Geni Сурагч нь Geni Платформыг ашиглан Geni сурагчын хөтөлбөрийн
            видео хичээлүүдийг худалдан авч үзэх болон хөтөлбөрийн даалгавар
            контентийг хийж илгээхэд ашиглана.
          </li>
        </ol>
        <p>Платформ ашиглах тухай:</p>
        <ol start={1}>
          <li>
            Контент бүтээгч нь Geni платформ дээр өөрийн албан ёсны хаягыг
            үүсгэн Geni Сурагчын хөтөлбөрийг худалдан авч, үзэх боломжтой.
          </li>
          <li>
            Geni платформ дээрх хэрэглэгчийн хувийн мэдээллийн аюулгүй байдлыг
            Geni платформын зүгээс хангах үүрэгтэй.
          </li>
          <li>
            Сурагч нь өөрийн хурдаар хичээлүүдээ үзэн хүссэн үедээ даалгавар
            контентоо илгээх боломжтой.
          </li>
          <li>
            Платформоор дамжуулан хөтөлбөрийн даалгаварыг илгээх бөгөөд уг
            даалгавар дээр Geni платформын зүгээс зөвлөгөө өгөх үүрэгтэй.
          </li>
          <li>
            Сурагч нь даалгавар дээр өгсөн зөвлөгөөний дагуу дахин даалгавар
            хийн илгээх үүрэгтэй.
          </li>
          <li>
            Сурагчын даалгавар Geni платформын шалгуурыг хангасан тохиолдолд
            албан ёсны Контент бүтээгч болох боломжтой.
          </li>
          <li>
            Сурагчын даалгавар тэнцсэнээр Албан ёсны контент бүтээгчийн хаягтай
            болж Брэндүүдтэй хамтрах эрхийг Geni Платформоос нээж өгөх үүрэгтэй.
          </li>
        </ol>
      </div> */}
    </div>
  );
}
