import React from "react";

function Step2({ setIsAgreed }: { setIsAgreed?: any }) {
  return (
    <div className="flex flex-col gap-2">
      <span className="text-xl sm:text-2xl xl:text-3xl font-bold">
        Платформыг ашиглах үйлчилгээний нөхцөл
      </span>
      <span className="text-[#6F6F6F] text-sm sm:text-base">
        Сүүлд шинэчлэгдсэн: 2024.12.13
      </span>

      <div className="text-xs sm:text-sm md:text-base lg:text-lg font-thin rounded-3xl border border-[#CDCDCD] py-3 sm:py-6 px-5 sm:px-8 w-full overflow-y-auto max-h-[160px] sm:max-h-[330px]">
        Брэндэд хамаарах нөхцлүүд <br />
        <br />
        Ерөнхий зүйл:  <br />
        <ul className="list-decimal ml-3 sm:ml-5">
          <li>
            Байгууллага буюу брэнд нь Geni Платформыг ашиглан Geni Платформ
            дээрх контент бүтээгчидтэй хамтран хэрэглэгчийн бүтээсэн видео
            контент бүтээж ажиллах ажлын үүрэг хариуцлага болон харилцааг
            зохицуулахад оршино.
          </li>
          <li>
            Брэнд нь Geni платформоор дамжуулан Geni платформ дээрх бүх контент
            бүтээгчидтэй хамтран ажиллах боломжтой.
          </li>
          <li>
            Geni платформ нь Брэндийг контент бүтээгчидтэй хамтран ажиллахад нь
            жуучлах болон хоорондын харилцаа холбоог зохицуулах үүрэгтэй.
          </li>
          <li>
            Geni платформ дээрх контент бүтээгчидтэй хамтран ажиллахдаа
            бүтээгдэхүүнээ контент бүтээгчдэд санал болгох үүднээс Geni
            платформруу илгээх ёстой бөгөөд энэ нь контент бүтээгчийн контентоо
            бүтээхэд зориулсан урсгал зардал гэж тооцогдоно.
          </li>
        </ul>
        <br />
        Платформ ашиглах тухай:
        <ul className="list-decimal ml-3 sm:ml-5">
          <li>
            Брэнд нь Geni платформ дээр өөрийн албан ёсны хаягыг үүсгэн Geni
            платформ дээрх контент бүтээгчидтэй хамтрах боломжтой.
          </li>
          <li>
            Geni платформоор дамжуулан контент бүтээгчидтэй хамтран ажиллахдаа
            контент бүтээгчидтэй хамтран ажиллах эрх буюу “Geni Credit”-г
            идэвхжүүлж цэнэглэсний дараа контент бүтээгчидтэй хамтрах эрхтэй
            болно.
          </li>
          <li>
            Брэнд нь “Geni Credit”-н тоогоор бүтээгчидтэй хамтрах эрхтэй болох
            бөгөөд 4 төрлийн багцтай. Тухайн багцаас хамааран “Geni Credit”-н
            тоо болон үнийн дүн харилцан өөр өөр байна.
            <ul>
              <li>
                a. Geni credit: 3 ширхэг - Нэгж үнэ: 250’000₮ - Нийт үнэ:
                750’000₮
              </li>
              <li>
                b. Geni credit: 8 ширхэг - Нэгж үнэ: 230’000₮ - Нийт үнэ:
                1’840’000₮
              </li>
              <li>
                c. Geni credit: 15 ширхэг - Нэгж үнэ: 210’000₮ - Нийт үнэ:
                3’150’000₮
              </li>
              <li>
                d. Geni credit: 30 ширхэг - Нэгж үнэ: 190’000₮ - Нийт үнэ:
                5’700’000₮
              </li>
            </ul>
          </li>
          <li>
            “Geni Credit” дууссан тохиолдолд Geni платформыг ашиглан хүссэн
            үедээ дахин цэнэглэж ашиглах боломжтой.
          </li>
          <li>
            Брэнд нь “Geni Credit”-н цэнэглэсэн тоогоо ашиглан Geni платформ
            дээр өөрсдийн бараа бүтээгдэхүүний мэдээллээ болон ямар агуулгатай
            контент контент бүтээгчдээс авмаар байгаа хүсэлтээ ойлгомжтой сайн
            бичиж илгээх шаардлагатай бөгөөд уг бичсэн илгээсэн хүсэлтийн дагуу
            контент бүтээгчид контентоо хийж илгээх юм.
          </li>
          <li>
            Бүтээгдэхүүний хүсэлтээ илгээхдээ нэг контент бүтээгчид хамгийн
            багадаа 30’000 төгрөгний үнэ бүхий бүтээгдэхүүнийг санал болгоно.
            Энэ нь контент бүтээгчдийн сэтгэл ханамжыг хангахад зориулагдана.
          </li>
          <li>
            Бүтээгдэхүүний мэдээлэл илгээсний дараа оруулсан мэдээллийн дагуу
            бүтээгдэхүүнээ Geni платформ-н агуулахруу хүргүүлэх үүрэгтэй.
          </li>
          <li>
            Geni платформын зүгээс бараа бүтээгдэхүүний илгээсэн мэдээллийг
            шалгасны дараагаар албан ёсоор платформ дээр бүтээгдэхүүний мэдээлэл
            байршина.
          </li>
          <li>
            Geni платформ дээр бүтээгдэхүүний мэдээлэл байршсаны дараагаар
            тухайн бүтээгдэхүүнийг авч контент бүтээх хүсэлтээ контент бүтээгчид
            Geni платформ луу илгээнэ.
          </li>
          <li>
            Контент бүтээгчдийн хүсэлтийг Geni платформоос хүлээн зөвшөөрсөнөөс
            эхлэн контент брэндэд очих хүртэлх бүх процессийг платформоор
            дамжуулан хянана. Үүнд дараах төлөвүүд орно:
            <ul>
              <li>a. Бүтээгдэхүүн контент бүтээгчид хүргэгдэж байна.</li>
              <li>b. Контент бүтээгч бүтээгдэхүүнийг хүлээн авсан. </li>
              <li>c. Контент бүтээгч контентоо хийж байна. </li>
              <li>d. Контент бүтээгч контентоо илгээлээ.</li>
              <li>
                e. Контент бүтээгчийн контентийг Geni платформын зүгээс шалгаж
                байна.
              </li>
              <li>
                f. Контент бүтээгчийн контент шаардлага хангаагүй тул засварлаж
                байна.
              </li>
              <li>
                g. Контент бүтээгчийн контент шаардлага хангаж брэндэд
                илгээгдлээ.
              </li>
              <li>
                h. Брэндийн контент засах хүсэлтийн дагуу контент бүтээгч засаж
                байна.
              </li>
              <li>i. Контент бүтээгч контентоо засаж илгээлээ.</li>
            </ul>
          </li>
          <li>
            Контент бүтээгчийн илгээсэн контентийг Geni платформын зүгээс нэг
            удаагын хяналт хийдэг бөгөөд ерөнхий контентийн чанар болон
            стандартыг хангасан байгаа эсэхийг шалгадаг.
          </li>
          <li>
            Geni платформын хяналтанд тэнцсэн контент брэндэд очих бөгөөд брэнд
            тухайн контентийг үзээд шууд хүлээн авч болно. Эсвэл засвар
            хийлгүүлэх хүсэлт илгээж болно.
          </li>
          <li>
            Брэндийн контент бүтээгчдэд илгээх контент засварын хүсэлт 1 удаа
            илгээж болно. Ингэхдээ дээд талдаа засах шаардлагтай 3 зүйлийг
            нарийн тодорхой оруулсан байна.
          </li>
          <li>
            Платформоор дамжуулан хийгдсэн контентийн оюуны өмчийг контент
            бүтээгч эзэмших бөгөөд хамтарсан Брэнд нь контентийг хугацаагүйгээр
            бүрэн ашиглах эрхтэй гэж явна.
          </li>
          <li>
            Контент бүтээгчийн илгээсэн контентийг авж ашиглахаасаа өмнө тухайн
            контент бүтээгчийн хийсэн контентод брэнд үнэлгээ өгөх бөгөөд
            нэмэлтээр сэтгэгдэл илгээх боломжтой. Контентийн үнэлгээг өгөхдөө
            дараах 3 төрлөөр өгнө. Үүнд:
            <ul>
              <li>a. Брэндийн хүсэлтийн дагуу хийсэн эсэх | 1-5 од</li>
              <li>b. Контентийн агуулга сайн эсэх | 1-5 од</li>
              <li>c. Контентийн хийцлэл сайн эсэх | 1-5 од</li>
            </ul>
          </li>
          <li>
            Контент бүтээгчдээс хүлээн авсан контентууд нь Брэндийн хаягын
            “Контент” хэсэгт байршина. Энэхүү хэсгээс Брэнд хүссэн үедээ
            контентуудаа үзэж татаж аван ашиглаж болно.
          </li>
          <li>
            Брэнд нь Geni платформ дээр байршуулсан бүтээгдэхүүний мэдээлэл
            болон контент бүтээгчдээс хүсэх хүсэлтээ өөрөө дахин засварлах
            боломжтой.
          </li>
          <li>
            Брэнд нь Geni платформын “Бүтээгдэхүүн” хэсгээс өөрийн байршуулсан
            бүтээгдэхүүний мэдээлэл болон тоо ширхэгийг харж, хянаж, нэмж,
            идэвхгүй болгох боломжтой.
          </li>
        </ul>
        <br />
        Контент стандарт тухай:
        <ul className="list-decimal ml-3 sm:ml-5">
          <li>
            Geni Платформоор дамжуулан контент бүтээгчдээс авах контент нь UGC
            буюу хэрэглэгчдийн бүтээсэн контентийн төрөлд багтах бөгөөд тус
            контентийн агуулга нь хэрэглэгч тухайн бүтээгдэхүүнийг бодитоор
            хэрэглэж үзсэн туршлага дээр үндэслэн хийгдэх болно.
          </li>
          <li>
            Хэрэглэгчдийн бүтээсэн контент нь бодит мэдээлэл дээр үндэслэн
            хийгдэх ёстой бөгөөд хэт зар сурталчилгаа шиг байх ёсгүй.
          </li>
          <li>
            Контентийн ерөнхий суурь стандартыг платформын зүгээс хянан
            шалгадаг. Үүнд:
            <ul>
              <li>a. Хэмжээ: 9x16 </li>
              <li>
                b. Хугацаа: Хамгийн багадаа - 20 секунд, Хамгийн ихдээ - 1:30
                секунд
              </li>
              <li>
                c. Бичиглэл: Үг үсгийн алдаа болон алдаагүй фонт байгаа эсэх.
              </li>
              <li>
                d. Ая болон дуу оруулга: Хэт сул болон чанга гэх мэт алдаа
                байгаа эсэх.
              </li>
              <li>
                e. Бичлэг чанар: Бичлэгний чанар хэт муу болон харанхуй орчинд
                гэх мэт тохиромжгүй зураг авалт хийсэн эсэх.
              </li>
            </ul>
          </li>
          <li>
            Брэндийн оруулсан бүтээгдэхүүний мэдээлэл болон контент бүтээгчдээс
            хүссэн хүсэлтийн дагуу контент бүтээгчид контентоо хийх үүрэгтэй.
          </li>
          <li>
            Брэндийн контентоо засуулах хүсэлтийн дагуу тус контент бүтээгч
            дахин контентоо засаж илгээх үүрэгтэй.
          </li>
          <li>
            Контент бүтээгчийн засаж илгээсэн контент нь брэндийн сэтгэгдэлд
            хүрээгүй тохиолдолд брэнд контент бүтээгчид муу үнэлгээ өгч дүгнэх
            эрхтэй.
          </li>
        </ul>
        <br />
        Үүрэг, хариуцлага
        <br />
        <ul className="list-decimal ml-3 sm:ml-5">
          <li>
            Брэнд нь Geni платформыг ашиглах эрх бүхий төлбөрөө 100% урьдчилан
            төлнө.
          </li>
          <li>
            Брэнд нь Geni платформ дээр оруулж буй бүтээгдэхүүний мэдээлэл болон
            контент бүтээгчээс хүсэж буй хүсэлтээ бүрэн хариуцна. Мэдээллээ
            дутуу оруулсанаас болж үүссэн контент гүйцэтгэлийн асуудлыг  брэнд
            хариуцна.
          </li>
          <li>
            Брэнд нь Geni платформоор дамжуулан контент бүтээгчидтэй хамтран
            ажиллахдаа илгээж буй бүтээгдэхүүний эвдрэл гэмтэл болон дуусах
            хугацааны алдангыг бүрэн хариуцна.
          </li>
          <li>
            Брэндтэй хамтран ажиллаж буй контент бүтээгч нь контентоо өгөх
            хугацаа нь бүтээгдэхүүн хүргэгдэж очсоноос хойш 7 хоног байна. Харин
            үүнээс хойш хоцроосон тохиолдолд тохирсон хариуцлагыг Geni
            платформын зүгээс авна. Үүнд:
            <ul>
              <li>a. Контент бүтээгчид сануулга өгөх</li>
              <li>b. Контент бүтээгчийн оноог хасах</li>
              <li>
                c. Контент бүтээгчийн бүтээгдэхүүн сонгох эрхийг тодорхой
                хугацаанд хаах
              </li>
              <li>d. Контент бүтээгчийн хаягыг хаах</li>
            </ul>
          </li>
          <li>
            Контент бүтээгч нь контентоо өгөлгүй 14-с дээш хоног болсон
            тохиолдолд Geni платформын зүгээс Брэндийн Geni Credit-г буцаан
            нөхөн олгохоос гадна Брэндийн контент бүтээгчрүү илгээсэн
            бүтээгдэхүүний үнийн дүнг нөхөн олгоно.
          </li>
          <li>
            Брэнд нь контент бүтээгчийн хийсэн контентийг дүгнэж оноо өгөх
            үүрэгтэй.
          </li>
          <li>
            Платформоос гадна Geni платформ дээрх контент бүтээгчидтэй
            хамтрахгүй байх үүрэгтэй.
          </li>
        </ul>
      </div>
    </div>
  );
}

export default Step2;
