import React from "react";

function Step2({ setIsAgreed }: { setIsAgreed?: any }) {
  return (
    <div className="flex flex-col gap-2">
      <span className="text-xl sm:text-2xl xl:text-3xl font-bold">
        Платформыг ашиглах үйлчилгээний нөхцөл
      </span>
      <span className="text-[#6F6F6F] text-sm sm:text-base">
        Сүүлд шинэчлэгдсэн: 2024.12.13
      </span>

      <div className="text-xs sm:text-sm md:text-base lg:text-lg font-thin rounded-3xl border border-[#CDCDCD] py-3 sm:py-6 px-5 sm:px-8 w-full overflow-y-auto max-h-[160px] sm:max-h-[330px]">
        Брэндэд хамаарах нөхцлүүд <br />
        <br /> 1.1 Төлбөр ба буцаан олголт <br />
        <br />
        1.1.1 Geni brand нь Geni platform-с сонгосон багцынхаа төлбөрийг 100%
        төлснөөр тухайн багц идэвхжин, бүтээгдэхүүн нэмэх, хүргэх, бүтээгчидтэй
        хамтран ажиллах, контент хүлээн авах эрх нээгдэнэ. 
        <br />
        <br /> 1.1.2 Geni platform-н үйлчилгээтэй холбоотой бүх төлбөр зөвхөн
        платформын өөрийн төлбөрийн системээр дамжин хийгдэнэ.
        <br />
        <br /> 1.1.3 Geni платформ Geni brand-д тохирсон контентыг давагдашгүй
        хүчин зүйлээс үл хамааран заасан хугацаанд контентыг хүлээлгэн өгөөгүй
        тохиолдолд платформ тухайн бүтээгдэхүүний үнийн дүнг Geni brand-д төлж,
        нэгж контентийн үнийн дүнг тооцохгүйгээр дахин  контент хийж өгнө.
        <br />
        <br /> 1.1.4 Geni brand-н хүлээлгэн өгсөн бүтээгдэхүүний тоо хэмжээтэй
        ижил тооны контентыг Geni платформ нийлүүлээгүй тохиолдолд
        бүтээгдэхүүний нэрлэсэн үнийн дүнг төлж хохирлыг барагдуулна.
        <br />
        <br />
        1.1.5 Geni brand баталгаажуулсан аливаа багцийг шийдвэрлэх боломжгүй
        хүндэтгэн үзэх шалтгаанаар цуцлах тохиолдолд “Geni платформ сонгосон
        багцийн үнийн дүнгээс 15 хувийн алданги суутгаж шилжүүлнэ. Тухайн
        багцийг баталгаажуулснаас 3 хоногийн дотор цуцлах харилцааг зохицуулах
        бөгөөд багц идэвхжиж, контент бүтээгчид ажилаа эхлүүлсэн тохиолдолд
        багцийн буцаан олголт олгогдохгүй боломжгүй.
        <br />
        <br />
        2.1 Контент хүлээн авах
        <br />
        <br />
        2.1.1 Geni brand идэвхижүүлсэн credit буюу контентын тоогоор бүтээгчдэд
        илгээх бараа бүтээгдэхүүнээ Geni platform-д хүргэх үүрэгтэй.
        <br />
        <br />
        2.1.2 Geni platform бүтээгдэхүүнийг хүлээж авсны дараагаар контент
        бүтээгчид бүтээгдэхүүнийг хүлээлгэн өгөх бөгөөд бүтээгдэхүүнийг контент
        бүтээгч хүлээн авсан хугацаанаас эхлэн Geni brand-д контентыг 1 сарын
        хугацаанд хүлээлгэн өгнө.
        <br />
        <br />
        2.1.3 Брэнд контентыг доорхи чиглэлийн хүрээнд үнэлнэ:
        <br />
        <br />
        2.1.3.a Хэрэглэгчийн сэтгэгдэл бүхий агуулга  Брэндийн бүтээгдэхүүн
        үйлчилгээг хэрэглэж үзсэн хэрэглэгчийн сэтгэгдэл, үзэл бодол шингэсэн
        оригнал агуулга заавал шингэсэн байх хэрэгтэй бөгөөд тухайн агуулга хэр
        үнэ бодитой, чанартай байгааг брэнд үнэлнэ.
        <br />
        <br />
        2.1.3.б Брэндийн агуулга Брэнд бүтээгдэхүүний санал дээр өөрсдийн зүгээс
        контентод дурьдахыг хүссэн мессеж, бүтээгдэхүүний онцлог, давуу тал,
        брэндтэй холбоотой мэдээлэл зэргийг дэлгэрэнгүй оруулж өгсөн байх бөгөөд
        үүнийг бүтээгч контентдоо зохистой хэлбэрээр оруулсан эсэхийг брэнд
        үнэлнэ. 
        <br />
        <br />
        2.1.3.в Контент хийцлэл Брэнд контентийн хийцлэл буюу бүтээгчийн
        контентдоо ашигласан дуу, дүрс, текст, эдит хийсэн байдал зэргийг чанар
        талаас үнэлнэ. 
        <br />
        <br />
        2.1.4 Бүтээгчийн контентийг үнэлэх нь брэнд сэтгэл ханамжидaa нийцсэн
        контент хүлээн авах, цаашид улам сайжруулахад туслах учраас заавал
        үнэлгээ өгөх үүрэгтэй.
      </div>
    </div>
  );
}

export default Step2;
