"use client";
import React from "react";
import { useRouter, useParams } from "next/navigation";

import Image from "next/image";

function page() {
  const router = useRouter();
  const params = useParams();
  const { id } = params; // assuming the URL parameter is named 'plan'

  return (
    <div className="min-h-screen w-full h-full bg-white">
      <div className="pt-32 pb-24">
        <div className="container min-h-screen text-[#2D262D] max-w-7xl mx-auto px-7 py-20 flex flex-col">
          <button
            onClick={() => router.back()}
            className="w-14 h-14 bg-[#F5F4F0] rounded-lg p-4"
          >
            <Image
              src={"/arrow-left.png"}
              width={24}
              height={24}
              alt="arrow-left"
            />
          </button>
          <div className="rounded-3xl bg-[#F5F4F0] p-10 mt-7 flex flex-row gap-4">
            <div className="w-full flex flex-col gap-8">
              <Image
                src={"/dummy-notification-big.png"}
                width={1052}
                height={214}
                alt="not"
                className="rounded-2xl w-full"
              />

              <div className="flex flex-col gap-2">
                <div className="flex flex-row justify-between items-center">
                  <span className="font-bold text-3xl">
                    {notifications[id].title}
                  </span>
                  <span className="text-[#6F6F6F] text-lg">
                    {notifications[id].date} {notifications[id].time}
                  </span>
                </div>

                <span className="text-[#6F6F6F] text-lg">
                  {notifications[id].tag}
                </span>
                <span className="text-[#6F6F6F] text-lg mt-3">
                  {notifications[id].desc}
                </span>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}

export default page;

const notifications = [
  {
    status: "unread",
    image: "/dummy-notification.png",
    title: "Platform new feature update",
    tag: "@geni.team",
    desc: "Бид олон нийтэд нээлттэй компаниудын хувьцаа эзэмшигчдийн хурлаар яригдсан зүйлсийг уншигчдадаа ойлгомжтой, дэлгэрэнгүй хүргэх зорилгоор “LP Transcript” буюу хурлын тэмдэглэлийн контент гаргаж байгаа билээ. LP Transcript-н ээлжит дугаараар АПУ ХК (APU)-ийн хувьцаа эзэмшигчдийн хурлын тэмдэглэлийг хүргэж байна. Тухлан сууж, таалан уншина уу! Нэг цаг үед банканд очерлож хамаг тог ус, кабелийн мөнгөө төлдөг байж билээ. Ингэж дурсаж ярих өдөр ирэх юм чинээ яаж санах вэ дээ.  Сүүлийн үед дижитал шийдлүүд улам бүр л нэмэгдэж байна. Эдгээр нь бидний амьдралд хэрхэн нөлөөлж байгаа талаар тоймлоё.  Уг үндэс  Дижиталчлал хурдсаж байгаагийн гол үндэс нь бид бүхний интернэт болон дата хэрэглээ билээ. Угаас 2015 оноос хойш нийт интернэт хэрэглэгчдийн давхардсан тоо 1.6 дахин нэмэгдэж 4.4 саяд хүрсэн билээ. Үүнтэй холбоотойгоор харилцаа холбоо болон банк санхүүгийн байгууллагуудын дижитал, финтек шийдлүүд ч нэмэгдсэн.  Дижитал тэлэлт: Түүнчлэн Монголын дижитал худалдааны зах зээл мөн өссөөр 2028 он гэхэд зах зээлийн хэмжээ нь $1.1 тэрбумд хүрэх төлөвтэй байна. Энэхүү өсөлт нь интернэтийн хэрэглээ болон дижитал платформуудын хөгжил, үйлчилгээ нэмэгдсэнтэй холбоотой билээ.  Шинэ үе & шинэ шийдэл  Үүгээр ч зогсохгүй харилцаа холбооны салбарынхан ч дижитал шийдлүүдийг олноор нэвтрүүлсэн. Улмаар бид утсандаа нэгж авах гэж дэлгүүр гарах, интернэтийн төлбөрөө хийх гэж ямар нэгэн салбар руу зорьж очихоо больж Юнителийн платформ руу ороод л дижиталаар төлдөг болсон билээ. Мөн банкны салбарт ч шинэ салхи орж Монголын анхны необанк болох М Банк ч зах зээлд хүч түрэн орж ирсэн. Танд дуулгах урамшуулал: Тус банк финтек болон харилцаа холбооны хамтын ажиллагааг сайжруулахаар Юнител Групптэй хамтран ажиллаж буй. Энэ хүрээнд Юнител болон Юнивишнийн үйлчилгээний төлбөрөө М банк-аар төлөөд ₮100,000 тутамд бэлэг авах урамшуулал зарласан аж. Хэрэглэгч бидэнд бол алдаж болохгүй боломж биз дээ?  Эцэст нь…  Дижитал бүтээгдэхүүн, шийдлүүд нэмэгдэхийн хэрээр амьдрал илүү амар болж байна даа. Олон ч боломж, урамшуулал нээгдэж байна.",
    date: "05/16/2024",
    time: "14:00",
  },
  {
    status: "unread",
    image: "/dummy-notification.png",
    title: "Platform new feature update",
    tag: "@geni.team",
    desc: "Бид олон нийтэд нээлттэй компаниудын хувьцаа эзэмшигчдийн хурлаар яригдсан зүйлсийг уншигчдадаа ойлгомжтой, дэлгэрэнгүй хүргэх зорилгоор “LP Transcript” буюу хурлын тэмдэглэлийн контент гаргаж байгаа билээ. LP Transcript-н ээлжит дугаараар АПУ ХК (APU)-ийн хувьцаа эзэмшигчдийн хурлын тэмдэглэлийг хүргэж байна. Тухлан сууж, таалан уншина уу! Нэг цаг үед банканд очерлож хамаг тог ус, кабелийн мөнгөө төлдөг байж билээ. Ингэж дурсаж ярих өдөр ирэх юм чинээ яаж санах вэ дээ.  Сүүлийн үед дижитал шийдлүүд улам бүр л нэмэгдэж байна. Эдгээр нь бидний амьдралд хэрхэн нөлөөлж байгаа талаар тоймлоё.  Уг үндэс  Дижиталчлал хурдсаж байгаагийн гол үндэс нь бид бүхний интернэт болон дата хэрэглээ билээ. Угаас 2015 оноос хойш нийт интернэт хэрэглэгчдийн давхардсан тоо 1.6 дахин нэмэгдэж 4.4 саяд хүрсэн билээ. Үүнтэй холбоотойгоор харилцаа холбоо болон банк санхүүгийн байгууллагуудын дижитал, финтек шийдлүүд ч нэмэгдсэн.  Дижитал тэлэлт: Түүнчлэн Монголын дижитал худалдааны зах зээл мөн өссөөр 2028 он гэхэд зах зээлийн хэмжээ нь $1.1 тэрбумд хүрэх төлөвтэй байна. Энэхүү өсөлт нь интернэтийн хэрэглээ болон дижитал платформуудын хөгжил, үйлчилгээ нэмэгдсэнтэй холбоотой билээ.  Шинэ үе & шинэ шийдэл  Үүгээр ч зогсохгүй харилцаа холбооны салбарынхан ч дижитал шийдлүүдийг олноор нэвтрүүлсэн. Улмаар бид утсандаа нэгж авах гэж дэлгүүр гарах, интернэтийн төлбөрөө хийх гэж ямар нэгэн салбар руу зорьж очихоо больж Юнителийн платформ руу ороод л дижиталаар төлдөг болсон билээ. Мөн банкны салбарт ч шинэ салхи орж Монголын анхны необанк болох М Банк ч зах зээлд хүч түрэн орж ирсэн. Танд дуулгах урамшуулал: Тус банк финтек болон харилцаа холбооны хамтын ажиллагааг сайжруулахаар Юнител Групптэй хамтран ажиллаж буй. Энэ хүрээнд Юнител болон Юнивишнийн үйлчилгээний төлбөрөө М банк-аар төлөөд ₮100,000 тутамд бэлэг авах урамшуулал зарласан аж. Хэрэглэгч бидэнд бол алдаж болохгүй боломж биз дээ?  Эцэст нь…  Дижитал бүтээгдэхүүн, шийдлүүд нэмэгдэхийн хэрээр амьдрал илүү амар болж байна даа. Олон ч боломж, урамшуулал нээгдэж байна.",
    date: "05/16/2024",
    time: "14:00",
  },
  {
    status: "read",
    image: "/dummy-notification.png",
    title: "Platform new feature update",
    tag: "@geni.team",
    desc: "Бид олон нийтэд нээлттэй компаниудын хувьцаа эзэмшигчдийн хурлаар яригдсан зүйлсийг уншигчдадаа ойлгомжтой, дэлгэрэнгүй хүргэх зорилгоор “LP Transcript” буюу хурлын тэмдэглэлийн контент гаргаж байгаа билээ. LP Transcript-н ээлжит дугаараар АПУ ХК (APU)-ийн хувьцаа эзэмшигчдийн хурлын тэмдэглэлийг хүргэж байна. Тухлан сууж, таалан уншина уу! Нэг цаг үед банканд очерлож хамаг тог ус, кабелийн мөнгөө төлдөг байж билээ. Ингэж дурсаж ярих өдөр ирэх юм чинээ яаж санах вэ дээ.  Сүүлийн үед дижитал шийдлүүд улам бүр л нэмэгдэж байна. Эдгээр нь бидний амьдралд хэрхэн нөлөөлж байгаа талаар тоймлоё.  Уг үндэс  Дижиталчлал хурдсаж байгаагийн гол үндэс нь бид бүхний интернэт болон дата хэрэглээ билээ. Угаас 2015 оноос хойш нийт интернэт хэрэглэгчдийн давхардсан тоо 1.6 дахин нэмэгдэж 4.4 саяд хүрсэн билээ. Үүнтэй холбоотойгоор харилцаа холбоо болон банк санхүүгийн байгууллагуудын дижитал, финтек шийдлүүд ч нэмэгдсэн.  Дижитал тэлэлт: Түүнчлэн Монголын дижитал худалдааны зах зээл мөн өссөөр 2028 он гэхэд зах зээлийн хэмжээ нь $1.1 тэрбумд хүрэх төлөвтэй байна. Энэхүү өсөлт нь интернэтийн хэрэглээ болон дижитал платформуудын хөгжил, үйлчилгээ нэмэгдсэнтэй холбоотой билээ.  Шинэ үе & шинэ шийдэл  Үүгээр ч зогсохгүй харилцаа холбооны салбарынхан ч дижитал шийдлүүдийг олноор нэвтрүүлсэн. Улмаар бид утсандаа нэгж авах гэж дэлгүүр гарах, интернэтийн төлбөрөө хийх гэж ямар нэгэн салбар руу зорьж очихоо больж Юнителийн платформ руу ороод л дижиталаар төлдөг болсон билээ. Мөн банкны салбарт ч шинэ салхи орж Монголын анхны необанк болох М Банк ч зах зээлд хүч түрэн орж ирсэн. Танд дуулгах урамшуулал: Тус банк финтек болон харилцаа холбооны хамтын ажиллагааг сайжруулахаар Юнител Групптэй хамтран ажиллаж буй. Энэ хүрээнд Юнител болон Юнивишнийн үйлчилгээний төлбөрөө М банк-аар төлөөд ₮100,000 тутамд бэлэг авах урамшуулал зарласан аж. Хэрэглэгч бидэнд бол алдаж болохгүй боломж биз дээ?  Эцэст нь…  Дижитал бүтээгдэхүүн, шийдлүүд нэмэгдэхийн хэрээр амьдрал илүү амар болж байна даа. Олон ч боломж, урамшуулал нээгдэж байна.",
    date: "05/16/2024",
    time: "14:00",
  },
];
